lkolbly/cmsis-svd/data/TexasInstruments/LM4F111B2QR.svd
        <register>
          <name>RCGC1</name>
          <description>Run Mode Clock Gating Control Register 1</description>
          <addressOffset>0x00000104</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGC1_UART0</name>
              <description>UART0 Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_UART1</name>
              <description>UART1 Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_UART2</name>
              <description>UART2 Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_SSI0</name>
              <description>SSI0 Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_SSI1</name>
              <description>SSI1 Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_QEI0</name>
              <description>QEI0 Clock Gating Control</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_QEI1</name>
              <description>QEI1 Clock Gating Control</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_I2C0</name>
              <description>I2C0 Clock Gating Control</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_I2C1</name>
              <description>I2C1 Clock Gating Control</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_TIMER0</name>
              <description>Timer 0 Clock Gating Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_TIMER1</name>
              <description>Timer 1 Clock Gating Control</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_TIMER2</name>
              <description>Timer 2 Clock Gating Control</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_TIMER3</name>
              <description>Timer 3 Clock Gating Control</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_COMP0</name>
              <description>Analog Comparator 0 Clock Gating</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_COMP1</name>
              <description>Analog Comparator 1 Clock Gating</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_COMP2</name>
              <description>Analog Comparator 2 Clock Gating</description>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGC2</name>
          <description>Run Mode Clock Gating Control Register 2</description>
          <addressOffset>0x00000108</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGC2_GPIOA</name>
              <description>Port A Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC2_GPIOB</name>
              <description>Port B Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC2_GPIOC</name>
              <description>Port C Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC2_GPIOD</name>
              <description>Port D Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC2_GPIOE</name>
              <description>Port E Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC2_GPIOF</name>
              <description>Port F Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC2_GPIOG</name>
              <description>Port G Clock Gating Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC2_GPIOH</name>
              <description>Port H Clock Gating Control</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC2_GPIOJ</name>
              <description>Port J Clock Gating Control</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC2_UDMA</name>
              <description>Micro-DMA Clock Gating Control</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC2_USB0</name>
              <description>USB0 Clock Gating Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGC0</name>
          <description>Sleep Mode Clock Gating Control Register 0</description>
          <addressOffset>0x00000110</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGC0_WDT0</name>
              <description>WDT0 Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC0_HIB</name>
              <description>HIB Clock Gating Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC0_ADC0</name>
              <description>ADC0 Clock Gating Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC0_ADC1</name>
              <description>ADC1 Clock Gating Control</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC0_PWM0</name>
              <description>PWM Clock Gating Control</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC0_CAN0</name>
              <description>CAN0 Clock Gating Control</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC0_CAN1</name>
              <description>CAN1 Clock Gating Control</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC0_WDT1</name>
              <description>WDT1 Clock Gating Control</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGC1</name>
          <description>Sleep Mode Clock Gating Control Register 1</description>
          <addressOffset>0x00000114</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGC1_UART0</name>
              <description>UART0 Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_UART1</name>
              <description>UART1 Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_UART2</name>
              <description>UART2 Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_SSI0</name>
              <description>SSI0 Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_SSI1</name>
              <description>SSI1 Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_QEI0</name>
              <description>QEI0 Clock Gating Control</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_QEI1</name>
              <description>QEI1 Clock Gating Control</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_I2C0</name>
              <description>I2C0 Clock Gating Control</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_I2C1</name>
              <description>I2C1 Clock Gating Control</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_TIMER0</name>
              <description>Timer 0 Clock Gating Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_TIMER1</name>
              <description>Timer 1 Clock Gating Control</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_TIMER2</name>
              <description>Timer 2 Clock Gating Control</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_TIMER3</name>
              <description>Timer 3 Clock Gating Control</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_COMP0</name>
              <description>Analog Comparator 0 Clock Gating</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_COMP1</name>
              <description>Analog Comparator 1 Clock Gating</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_COMP2</name>
              <description>Analog Comparator 2 Clock Gating</description>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGC2</name>
          <description>Sleep Mode Clock Gating Control Register 2</description>
          <addressOffset>0x00000118</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGC2_GPIOA</name>
              <description>Port A Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC2_GPIOB</name>
              <description>Port B Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC2_GPIOC</name>
              <description>Port C Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC2_GPIOD</name>
              <description>Port D Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC2_GPIOE</name>
              <description>Port E Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC2_GPIOF</name>
              <description>Port F Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC2_GPIOG</name>
              <description>Port G Clock Gating Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC2_GPIOH</name>
              <description>Port H Clock Gating Control</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC2_GPIOJ</name>
              <description>Port J Clock Gating Control</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC2_UDMA</name>
              <description>Micro-DMA Clock Gating Control</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC2_USB0</name>
              <description>USB0 Clock Gating Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGC0</name>
          <description>Deep Sleep Mode Clock Gating Control Register 0</description>
          <addressOffset>0x00000120</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGC0_WDT0</name>
              <description>WDT0 Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC0_HIB</name>
              <description>HIB Clock Gating Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC0_ADC0</name>
              <description>ADC0 Clock Gating Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC0_ADC1</name>
              <description>ADC1 Clock Gating Control</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC0_PWM0</name>
              <description>PWM Clock Gating Control</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC0_CAN0</name>
              <description>CAN0 Clock Gating Control</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC0_CAN1</name>
              <description>CAN1 Clock Gating Control</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC0_WDT1</name>
              <description>WDT1 Clock Gating Control</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGC1</name>
          <description>Deep-Sleep Mode Clock Gating Control Register 1</description>
          <addressOffset>0x00000124</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGC1_UART0</name>
              <description>UART0 Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_UART1</name>
              <description>UART1 Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_UART2</name>
              <description>UART2 Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_SSI0</name>
              <description>SSI0 Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_SSI1</name>
              <description>SSI1 Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_QEI0</name>
              <description>QEI0 Clock Gating Control</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_QEI1</name>
              <description>QEI1 Clock Gating Control</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_I2C0</name>
              <description>I2C0 Clock Gating Control</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_I2C1</name>
              <description>I2C1 Clock Gating Control</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_TIMER0</name>
              <description>Timer 0 Clock Gating Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_TIMER1</name>
              <description>Timer 1 Clock Gating Control</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_TIMER2</name>
              <description>Timer 2 Clock Gating Control</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_TIMER3</name>
              <description>Timer 3 Clock Gating Control</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_COMP0</name>
              <description>Analog Comparator 0 Clock Gating</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_COMP1</name>
              <description>Analog Comparator 1 Clock Gating</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_COMP2</name>
              <description>Analog Comparator 2 Clock Gating</description>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGC2</name>
          <description>Deep Sleep Mode Clock Gating Control Register 2</description>
          <addressOffset>0x00000128</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGC2_GPIOA</name>
              <description>Port A Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC2_GPIOB</name>
              <description>Port B Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC2_GPIOC</name>
              <description>Port C Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC2_GPIOD</name>
              <description>Port D Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC2_GPIOE</name>
              <description>Port E Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC2_GPIOF</name>
              <description>Port F Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC2_GPIOG</name>
              <description>Port G Clock Gating Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC2_GPIOH</name>
              <description>Port H Clock Gating Control</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC2_GPIOJ</name>
              <description>Port J Clock Gating Control</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC2_UDMA</name>
              <description>Micro-DMA Clock Gating Control</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC2_USB0</name>
              <description>USB0 Clock Gating Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DSLPCLKCFG</name>
          <description>Deep Sleep Clock Configuration</description>
          <addressOffset>0x00000144</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DSLPCLKCFG_O</name>
              <description>Clock Source</description>
              <bitRange>[6:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_O_IGN</name>
                  <description>MOSC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_O_IO</name>
                  <description>PIOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_O_30</name>
                  <description>30 kHz</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DSLPCLKCFG_D</name>
              <description>Divider Field Override</description>
              <bitRange>[28:23]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_1</name>
                  <description>System clock /1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_2</name>
                  <description>System clock /2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_3</name>
                  <description>System clock /3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_4</name>
                  <description>System clock /4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_64</name>
                  <description>System clock /64</description>
                  <value>0x3f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSPROP</name>
          <description>System Properties</description>
          <addressOffset>0x0000014C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SYSPROP_FPU</name>
              <description>FPU Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
