lkolbly/cmsis-svd/data/TexasInstruments/LM4F111B2QR.svd
        <register>
          <name>CPAC</name>
          <description>Coprocessor Access Control</description>
          <addressOffset>0x00000D88</addressOffset>
          <fields>
            <field>
              <name>NVIC_CPAC_CP10</name>
              <description>CP10 Coprocessor Access Privilege</description>
              <bitRange>[21:20]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_CPAC_CP10_DIS</name>
                  <description>Access Denied</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_CPAC_CP10_PRIV</name>
                  <description>Privileged Access Only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_CPAC_CP10_FULL</name>
                  <description>Full Access</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVIC_CPAC_CP11</name>
              <description>CP11 Coprocessor Access Privilege</description>
              <bitRange>[23:22]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_CPAC_CP11_DIS</name>
                  <description>Access Denied</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_CPAC_CP11_PRIV</name>
                  <description>Privileged Access Only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_CPAC_CP11_FULL</name>
                  <description>Full Access</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_TYPE</name>
          <description>MPU Type</description>
          <addressOffset>0x00000D90</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_TYPE_SEPARATE</name>
              <description>Separate or Unified MPU</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_TYPE_DREGION</name>
              <description>Number of D Regions</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_TYPE_IREGION</name>
              <description>Number of I Regions</description>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_CTRL</name>
          <description>MPU Control</description>
          <addressOffset>0x00000D94</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_CTRL_ENABLE</name>
              <description>MPU Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_CTRL_HFNMIENA</name>
              <description>MPU Enabled During Faults</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_CTRL_PRIVDEFEN</name>
              <description>MPU Default Region</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_NUMBER</name>
          <description>MPU Region Number</description>
          <addressOffset>0x00000D98</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_NUMBER</name>
              <description>MPU Region to Access</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_BASE</name>
          <description>MPU Region Base Address</description>
          <addressOffset>0x00000D9C</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_BASE_REGION</name>
              <description>Region Number</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_BASE_VALID</name>
              <description>Region Number Valid</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_BASE_ADDR</name>
              <description>Base Address Mask</description>
              <bitRange>[31:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_ATTR</name>
          <description>MPU Region Attribute and Size</description>
          <addressOffset>0x00000DA0</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_ATTR_ENABLE</name>
              <description>Region Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_SIZE</name>
              <description>Region Size Mask</description>
              <bitRange>[5:1]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_SRD</name>
              <description>Subregion Disable Bits</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_BUFFRABLE</name>
              <description>Bufferable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_CACHEABLE</name>
              <description>Cacheable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_SHAREABLE</name>
              <description>Shareable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_TEX</name>
              <description>Type Extension Mask</description>
              <bitRange>[21:19]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_AP</name>
              <description>Access Privilege</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR_XN</name>
              <description>Instruction Access Disable</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_BASE1</name>
          <description>MPU Region Base Address Alias 1</description>
          <addressOffset>0x00000DA4</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_BASE1_REGION</name>
              <description>Region Number</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_BASE1_VALID</name>
              <description>Region Number Valid</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_BASE1_ADDR</name>
              <description>Base Address Mask</description>
              <bitRange>[31:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_ATTR1</name>
          <description>MPU Region Attribute and Size Alias 1</description>
          <addressOffset>0x00000DA8</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_ATTR1_ENABLE</name>
              <description>Region Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_SIZE</name>
              <description>Region Size Mask</description>
              <bitRange>[5:1]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_SRD</name>
              <description>Subregion Disable Bits</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_BUFFRABLE</name>
              <description>Bufferable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_CACHEABLE</name>
              <description>Cacheable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_SHAREABLE</name>
              <description>Shareable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_TEX</name>
              <description>Type Extension Mask</description>
              <bitRange>[21:19]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_AP</name>
              <description>Access Privilege</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR1_XN</name>
              <description>Instruction Access Disable</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_BASE2</name>
          <description>MPU Region Base Address Alias 2</description>
          <addressOffset>0x00000DAC</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_BASE2_REGION</name>
              <description>Region Number</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_BASE2_VALID</name>
              <description>Region Number Valid</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_BASE2_ADDR</name>
              <description>Base Address Mask</description>
              <bitRange>[31:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_ATTR2</name>
          <description>MPU Region Attribute and Size Alias 2</description>
          <addressOffset>0x00000DB0</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_ATTR2_ENABLE</name>
              <description>Region Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR2_SIZE</name>
              <description>Region Size Mask</description>
              <bitRange>[5:1]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR2_SRD</name>
              <description>Subregion Disable Bits</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR2_BUFFRABLE</name>
              <description>Bufferable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR2_CACHEABLE</name>
              <description>Cacheable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR2_SHAREABLE</name>
              <description>Shareable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR2_TEX</name>
              <description>Type Extension Mask</description>
              <bitRange>[21:19]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR2_AP</name>
              <description>Access Privilege</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR2_XN</name>
              <description>Instruction Access Disable</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_BASE3</name>
          <description>MPU Region Base Address Alias 3</description>
          <addressOffset>0x00000DB4</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_BASE3_REGION</name>
              <description>Region Number</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_BASE3_VALID</name>
              <description>Region Number Valid</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_BASE3_ADDR</name>
              <description>Base Address Mask</description>
              <bitRange>[31:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_ATTR3</name>
          <description>MPU Region Attribute and Size Alias 3</description>
          <addressOffset>0x00000DB8</addressOffset>
          <fields>
            <field>
              <name>NVIC_MPU_ATTR3_ENABLE</name>
              <description>Region Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR3_SIZE</name>
              <description>Region Size Mask</description>
              <bitRange>[5:1]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR3_SRD</name>
              <description>Subregion Disable Bits</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR3_BUFFRABLE</name>
              <description>Bufferable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR3_CACHEABLE</name>
              <description>Cacheable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR3_SHAREABLE</name>
              <description>Shareable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR3_TEX</name>
              <description>Type Extension Mask</description>
              <bitRange>[21:19]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR3_AP</name>
              <description>Access Privilege</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>NVIC_MPU_ATTR3_XN</name>
              <description>Instruction Access Disable</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_CTRL</name>
          <description>Debug Control and Status Reg</description>
          <addressOffset>0x00000DF0</addressOffset>
          <fields>
            <field>
              <name>NVIC_DBG_CTRL_C_DEBUGEN</name>
              <description>Enable debug</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_C_HALT</name>
              <description>Halt the core</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_C_STEP</name>
              <description>Step the core</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_C_MASKINT</name>
              <description>Mask interrupts when stepping</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_C_SNAPSTALL</name>
              <description>Breaks a stalled load/store</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_S_REGRDY</name>
              <description>Register read/write available</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_S_HALT</name>
              <description>Core status on halt</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_S_SLEEP</name>
              <description>Core is sleeping</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_S_LOCKUP</name>
              <description>Core is locked up</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_S_RETIRE_ST</name>
              <description>Core has executed insruction since last read</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_CTRL_S_RESET_ST</name>
              <description>Core has reset since last read</description>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_XFER</name>
          <description>Debug Core Reg. Transfer Select</description>
          <addressOffset>0x00000DF4</addressOffset>
          <fields>
            <field>
              <name>NVIC_DBG_XFER_REG_SEL</name>
              <description>Register</description>
              <bitRange>[4:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R0</name>
                  <description>Register R0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R1</name>
                  <description>Register R1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R2</name>
                  <description>Register R2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R3</name>
                  <description>Register R3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R4</name>
                  <description>Register R4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R5</name>
                  <description>Register R5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R6</name>
                  <description>Register R6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R7</name>
                  <description>Register R7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R8</name>
                  <description>Register R8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R9</name>
                  <description>Register R9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R10</name>
                  <description>Register R10</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R11</name>
                  <description>Register R11</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R12</name>
                  <description>Register R12</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R13</name>
                  <description>Register R13</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R14</name>
                  <description>Register R14</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R15</name>
                  <description>Register R15</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_FLAGS</name>
                  <description>xPSR/Flags register</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_MSP</name>
                  <description>Main SP</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_PSP</name>
                  <description>Process SP</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_DSP</name>
                  <description>Deep SP</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_CFBP</name>
                  <description>Control/Fault/BasePri/PriMask</description>
                  <value>0x14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVIC_DBG_XFER_REG_WNR</name>
              <description>Write or not read</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_DATA</name>
          <description>Debug Core Register Data</description>
          <addressOffset>0x00000DF8</addressOffset>
          <fields>
            <field>
              <name>NVIC_DBG_DATA</name>
              <description>Data temporary cache</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
